{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attrs": {"p": "0.2"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attrs": {
        "axis": "3", 
        "num_outputs": "199"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gru_0i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_0i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t0__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t0__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "gru_0begin_state_0", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 256)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_0h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_0h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t0__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t0__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[19, 1, 0], [24, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t0__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[19, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t0__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[29, 0, 0], [24, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[19, 2, 0], [30, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t0__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[27, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul2", 
      "inputs": [[26, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_0t0_out", 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gru_1i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_1i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t0__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t0__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "gru_1begin_state_0", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 256)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_1h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_1h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t0__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t0__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus598", 
      "inputs": [[39, 1, 0], [44, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t0__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar199", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus597", 
      "inputs": [[39, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t0__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul597", 
      "inputs": [[49, 0, 0], [44, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus599", 
      "inputs": [[39, 2, 0], [50, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t0__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul598", 
      "inputs": [[47, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul599", 
      "inputs": [[46, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_1t0_out", 
      "inputs": [[53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t1__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[15, 1, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t1__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t1__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[35, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t1__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[57, 1, 0], [59, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t1__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar1", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[57, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t1__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul3", 
      "inputs": [[64, 0, 0], [59, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[57, 2, 0], [65, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t1__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul4", 
      "inputs": [[62, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul5", 
      "inputs": [[61, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_0t1_out", 
      "inputs": [[68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t1__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[70, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t1__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t1__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[55, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t1__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus601", 
      "inputs": [[72, 1, 0], [74, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t1__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar200", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus600", 
      "inputs": [[72, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t1__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul600", 
      "inputs": [[79, 0, 0], [74, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus602", 
      "inputs": [[72, 2, 0], [80, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t1__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul601", 
      "inputs": [[77, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul602", 
      "inputs": [[76, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_1t1_out", 
      "inputs": [[83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t2__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[15, 2, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t2__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t2__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[70, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t2__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[87, 1, 0], [89, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t2__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar2", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[87, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t2__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul6", 
      "inputs": [[94, 0, 0], [89, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[87, 2, 0], [95, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t2__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul7", 
      "inputs": [[92, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul8", 
      "inputs": [[91, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_0t2_out", 
      "inputs": [[98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t2__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[100, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t2__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t2__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[85, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t2__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus604", 
      "inputs": [[102, 1, 0], [104, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t2__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar201", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus603", 
      "inputs": [[102, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t2__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul603", 
      "inputs": [[109, 0, 0], [104, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus605", 
      "inputs": [[102, 2, 0], [110, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t2__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul604", 
      "inputs": [[107, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul605", 
      "inputs": [[106, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_1t2_out", 
      "inputs": [[113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t3__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[15, 3, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t3__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t3__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[100, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t3__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[117, 1, 0], [119, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t3__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar3", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[117, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t3__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul9", 
      "inputs": [[124, 0, 0], [119, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[117, 2, 0], [125, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t3__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul10", 
      "inputs": [[122, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul11", 
      "inputs": [[121, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_0t3_out", 
      "inputs": [[128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t3__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[130, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t3__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t3__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[115, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t3__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus607", 
      "inputs": [[132, 1, 0], [134, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t3__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar202", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus606", 
      "inputs": [[132, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t3__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul606", 
      "inputs": [[139, 0, 0], [134, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus608", 
      "inputs": [[132, 2, 0], [140, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t3__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul607", 
      "inputs": [[137, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul608", 
      "inputs": [[136, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_1t3_out", 
      "inputs": [[143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t4__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[15, 4, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t4__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t4__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[130, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t4__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus13", 
      "inputs": [[147, 1, 0], [149, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t4__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar4", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[147, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t4__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul12", 
      "inputs": [[154, 0, 0], [149, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus14", 
      "inputs": [[147, 2, 0], [155, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t4__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul13", 
      "inputs": [[152, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul14", 
      "inputs": [[151, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_0t4_out", 
      "inputs": [[158, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t4__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[160, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t4__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t4__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[145, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t4__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus610", 
      "inputs": [[162, 1, 0], [164, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t4__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar203", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus609", 
      "inputs": [[162, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t4__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul609", 
      "inputs": [[169, 0, 0], [164, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus611", 
      "inputs": [[162, 2, 0], [170, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t4__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul610", 
      "inputs": [[167, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul611", 
      "inputs": [[166, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_1t4_out", 
      "inputs": [[173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t5__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[15, 5, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t5__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t5__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[160, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t5__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus16", 
      "inputs": [[177, 1, 0], [179, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t5__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar5", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus15", 
      "inputs": [[177, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t5__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul15", 
      "inputs": [[184, 0, 0], [179, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus17", 
      "inputs": [[177, 2, 0], [185, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t5__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul16", 
      "inputs": [[182, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul17", 
      "inputs": [[181, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_0t5_out", 
      "inputs": [[188, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t5__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[190, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t5__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t5__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[175, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t5__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus613", 
      "inputs": [[192, 1, 0], [194, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t5__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar204", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus612", 
      "inputs": [[192, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t5__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul612", 
      "inputs": [[199, 0, 0], [194, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus614", 
      "inputs": [[192, 2, 0], [200, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t5__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul613", 
      "inputs": [[197, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul614", 
      "inputs": [[196, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_1t5_out", 
      "inputs": [[203, 0, 0], [204, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t6__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[15, 6, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t6__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t6__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[190, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t6__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[208, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus19", 
      "inputs": [[207, 1, 0], [209, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t6__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar6", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus18", 
      "inputs": [[207, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t6__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul18", 
      "inputs": [[214, 0, 0], [209, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus20", 
      "inputs": [[207, 2, 0], [215, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t6__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[216, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul19", 
      "inputs": [[212, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul20", 
      "inputs": [[211, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_0t6_out", 
      "inputs": [[218, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t6__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[220, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t6__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[221, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t6__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[205, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t6__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus616", 
      "inputs": [[222, 1, 0], [224, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t6__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar205", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus615", 
      "inputs": [[222, 0, 0], [224, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t6__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul615", 
      "inputs": [[229, 0, 0], [224, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus617", 
      "inputs": [[222, 2, 0], [230, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t6__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul616", 
      "inputs": [[227, 0, 0], [232, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul617", 
      "inputs": [[226, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_1t6_out", 
      "inputs": [[233, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t7__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[15, 7, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t7__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[236, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t7__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[220, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t7__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus22", 
      "inputs": [[237, 1, 0], [239, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t7__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar7", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[241, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus21", 
      "inputs": [[237, 0, 0], [239, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t7__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[243, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul21", 
      "inputs": [[244, 0, 0], [239, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus23", 
      "inputs": [[237, 2, 0], [245, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t7__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul22", 
      "inputs": [[242, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul23", 
      "inputs": [[241, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_0t7_out", 
      "inputs": [[248, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t7__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[250, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t7__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t7__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[235, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t7__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[253, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus619", 
      "inputs": [[252, 1, 0], [254, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t7__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar206", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[256, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus618", 
      "inputs": [[252, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t7__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul618", 
      "inputs": [[259, 0, 0], [254, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus620", 
      "inputs": [[252, 2, 0], [260, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t7__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[261, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul619", 
      "inputs": [[257, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul620", 
      "inputs": [[256, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_1t7_out", 
      "inputs": [[263, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t8__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[15, 8, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t8__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[266, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t8__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[250, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t8__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[268, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus25", 
      "inputs": [[267, 1, 0], [269, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t8__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar8", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[271, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus24", 
      "inputs": [[267, 0, 0], [269, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t8__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[273, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul24", 
      "inputs": [[274, 0, 0], [269, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus26", 
      "inputs": [[267, 2, 0], [275, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t8__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[276, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul25", 
      "inputs": [[272, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul26", 
      "inputs": [[271, 0, 0], [250, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_0t8_out", 
      "inputs": [[278, 0, 0], [279, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t8__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[280, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t8__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[281, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t8__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[265, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t8__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[283, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus622", 
      "inputs": [[282, 1, 0], [284, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t8__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[285, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar207", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus621", 
      "inputs": [[282, 0, 0], [284, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t8__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[288, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul621", 
      "inputs": [[289, 0, 0], [284, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus623", 
      "inputs": [[282, 2, 0], [290, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t8__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul622", 
      "inputs": [[287, 0, 0], [292, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul623", 
      "inputs": [[286, 0, 0], [265, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_1t8_out", 
      "inputs": [[293, 0, 0], [294, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t9__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[15, 9, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t9__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t9__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[280, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t9__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[298, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus28", 
      "inputs": [[297, 1, 0], [299, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t9__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[300, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar9", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[301, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus27", 
      "inputs": [[297, 0, 0], [299, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t9__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul27", 
      "inputs": [[304, 0, 0], [299, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus29", 
      "inputs": [[297, 2, 0], [305, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t9__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul28", 
      "inputs": [[302, 0, 0], [307, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul29", 
      "inputs": [[301, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_0t9_out", 
      "inputs": [[308, 0, 0], [309, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t9__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[310, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t9__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[311, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t9__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[295, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t9__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[313, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus625", 
      "inputs": [[312, 1, 0], [314, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t9__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[315, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar208", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[316, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus624", 
      "inputs": [[312, 0, 0], [314, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t9__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul624", 
      "inputs": [[319, 0, 0], [314, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus626", 
      "inputs": [[312, 2, 0], [320, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t9__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[321, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul625", 
      "inputs": [[317, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul626", 
      "inputs": [[316, 0, 0], [295, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_1t9_out", 
      "inputs": [[323, 0, 0], [324, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t10__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[15, 10, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t10__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[326, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t10__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[310, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t10__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[328, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus31", 
      "inputs": [[327, 1, 0], [329, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t10__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar10", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[331, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus30", 
      "inputs": [[327, 0, 0], [329, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t10__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[333, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul30", 
      "inputs": [[334, 0, 0], [329, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus32", 
      "inputs": [[327, 2, 0], [335, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t10__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul31", 
      "inputs": [[332, 0, 0], [337, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul32", 
      "inputs": [[331, 0, 0], [310, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_0t10_out", 
      "inputs": [[338, 0, 0], [339, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t10__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[340, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t10__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[341, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_1t10__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[325, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_1t10__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[343, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus628", 
      "inputs": [[342, 1, 0], [344, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t10__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[345, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar209", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[346, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus627", 
      "inputs": [[342, 0, 0], [344, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t10__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[348, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul627", 
      "inputs": [[349, 0, 0], [344, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus629", 
      "inputs": [[342, 2, 0], [350, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_1t10__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[351, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul628", 
      "inputs": [[347, 0, 0], [352, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul629", 
      "inputs": [[346, 0, 0], [325, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_1t10_out", 
      "inputs": [[353, 0, 0], [354, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t11__i2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[15, 11, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t11__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[356, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_0t11__h2h", 
      "attrs": {"num_hidden": "768"}, 
      "inputs": [[340, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_0t11__h2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[358, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus34", 
      "inputs": [[357, 1, 0], [359, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t11__z_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[360, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar11", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[361, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus33", 
      "inputs": [[357, 0, 0], [359, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t11__r_act", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[363, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul33", 
      "inputs": [[364, 0, 0], [359, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus35", 
      "inputs": [[357, 2, 0], [365, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_0t11__h_act", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[366, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul34", 
      "inputs": [[362, 0, 0], [367, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul35", 
      "inputs": [[361, 0, 0], [340, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
